1)ls1.c
Условие задачи:
Поменять в целом положительном числе (типа int) значение третьего
байта на введенное пользователем число (изначальное число также
вводится с клавиатуры) через указатель (не применяя битовые
операции).

2)ls2.c
Условие задачи:
В приведенном ниже коде измените только одну строку (помеченную),
чтобы напечатать “Результат: 12.0”.
//------------------------------------------//
#include <stdio.h>
int main(void)
{
 float x = 5.0;
 printf("x = %f, ", x);
 float y = 6.0;
 printf("y = %f\n", y);
 float *xp = &x; // TODO: отредактируйте эту строку, и только правую часть
уравнения
 float *yp = &y;
 printf("Результат: %f\n", *xp + *yp);
}
//------------------------------------------//

3)ls3.c
Условие задачи:
Напишите программу, в которой определите массив типа int (размер
массива 10 элементов от 1 до 10). Используйте указатель для вывода
элементов массива на консоль (применять можно только арифметику
указателей, а не индексы).

4)lc4.c
Условие задачи:
Напишите программу, которая ищет введенной строке (с клавиатуры)
введенную подстроку (с клавиатуры) и возвращает указатель на начало
подстроки, если подстрока не найдена в указатель записывается NULL.
В качестве срок использовать статические массивы.ю
